---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorEngagementLength
source: html/54a4bcd3-9982-cecf-4aa5-45eb4179d370.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorEngagementLength Property

"Engagement Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorEngagementLength { get; }
```